#!/usr/bin/python2.7
# -*- coding: utf-8 -*-
##########################################################


##########################################################
# Parameter Configuration
# Mohammad Mahdavi
# moh.mahdavi.l@gmail.com
# July 2016
# Homaplus Corporation
# homaplus.com
# All Rights Reserved
# Do not Change, Alter, or Remove this Licence
##########################################################


##########################################################
import os
##########################################################


##########################################################
# Folders Paths Parameters
MODEL_FOLDER = os.path.join(os.path.dirname(__file__), "Model")
FORMAL_HTML_DATA_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Formal", "HTML")
FORMAL_CORPUS_DATA_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Formal", "Corpus")
FORMAL_PROCESSED_DATA_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Formal", "Processed")
INFORMAL_CORPUS_DATA_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Informal", "Corpus")

# Web Services Parameters
GET_NEWS_TAGS_WEB_SERVICE_URL = "http://127.0.0.1:8080/api/v1/news/getNewsTags/"
GET_NEWS_STORY_WEB_SERVICE_URL = "http://127.0.0.1:8080/api/v1/news/getNewsStoryByDate/"
SET_GRAPH_PROCESSING_RESULT_WEB_SERVICE_URL = "http://127.0.0.1:8086/setGraphProcessingResults/"
GET_NEWS_BY_FILTERS_WEB_SERVICE_URL = "http://192.168.1.53:5008/getNewsByFilters/"
WEB_SERVICE_AUTHENTICATION = ("homaplus", "hom4+S3cr3t::")

# Alphabets Parameters
PUNCTUATION = """[~!@#$%^&*()-_=+{}\|;:'",<.>/?÷٪×،ـ»«؛؟…↓↑→←™®°∞٫]""".decode("utf-8")
PERSIAN_ALPHABET_FULL = """اآبپتثجچحخدذرزژسشصضطظعغفقکگلمنوهیئ\xE2\x80\x8C""".decode("utf-8")
PERSIAN_ALPHABET_JOINABLE = """بپتثجچحخسشصضطظعغفقکگلمنهیئ""".decode("utf-8")

# Term Information Parameters
TI_N_GRAM = 1
TI_FORMAL_STOP_WORD_PARAMETER = 0.9#0.9
TI_INFORMAL_STOP_WORD_PARAMETER = 0.85
TI_MIN_INFORMALITY_CONFIDENCE = 0.97

# Persian Text Normalization Parameters
PTN_HAMZEH_REPLACE_LIST = [("هیات".decode("utf-8"), "هیئت".decode("utf-8")),
                           ("مساله".decode("utf-8"), "مسئله".decode("utf-8")),
                           ("مسوول".decode("utf-8"), "مسئول".decode("utf-8")),
                           ("شوون".decode("utf-8"), "شئون".decode("utf-8")),
                           ("جرات".decode("utf-8"), "جرئت".decode("utf-8")),
                           ("مسالت".decode("utf-8"), "مسئلت".decode("utf-8"))]
PTN_HAMZEH_BLACK_LIST = \
"""ریال
رئال
اوین
اوئن
کوین
کوئن
لیون
لئون
شیون
شئون
ریالی
رئالی
کویری
کوئری
مایو
مائو
برایت
برائت""".decode("utf-8").splitlines()
PTN_N_GRAM = 2
PTN_TERM_MIN_SUPPORT = 5
PTN_TERM_MIN_CONFIDENCE = 0.9



# Automatic Keyphrase Extraction Parameters

AKE_TAG_STOPWORDS = \
"""هر
بر
در
را
به
با
تا
از
جز
پس
چه
که
هم
یا
سو
پی
تو
رو
الی
بهر
چون
مثل
مگر
اگر
اما
نیز
ولی
نزد
پیش
روی
زیر
زبر
سوی
جلو
گرد
بجز
الاّ
اندر
بدون
برای
غیرِ
باری
خواه
زیرا
لیکن
ازبس
میان
برون
بسان
 زیر
مانند
غیراز
آن‌جا
آن‌که
بس‌که
ازبهر
اکنون
اگرچه
نزدیک
دنبال
از پی
به‎محض
درقبال
درمیان
ازجمله
درخصوص
آن‌گاه
این‌که
به‌شرط
اندرون
بکردار
ازروی
ازبهر
درنزد
به‎مجرد
دربرابر
آن‌جاکه
ازبس‌که
چنان‌چه
چنان‌که
از برای
به‎غیراز
به‎عنوان
برخی
چنان
همان
قبل
بعد
امروز
دیروز
فردا
همه
شاید
به‎مثابه
ازاین‌روی
بااین‌حال
باوجوداین
به‎وسیله‎ی
به‎واسطه‎ی""".decode("utf-8").splitlines()

AKE_TAG_BLACK_LIST_SECOND_WORD = \
"""نفر
تن
نشده
اول
دوم
سوم
چهارم
پنجم
ششم
هفتم
هشتم
نهم
دهم
شده
شدند
فرد
مرد
زن""".decode("utf-8").splitlines()

AKE_TAG_BLACK_LIST_FIRST_WORD = \
"""یک
دو
سه
چهار
پنج
شش
هفت
هشت
نه
چند
چندین
آغاز
اولین
ده""".decode("utf-8").splitlines()

AKE_TAG_WHITE_LIST = \
"""اپل
سامسونگ
بانکوبیلبائوویسکایاآرخنتاریا
واتکینزاینکورپوریتد
موریندابیواکتیوز
ویلماراینترنشنال
ساکسزیونیورسیتی
یونایتدایرلاینز
اینتساسانپائولو
استانداردچارترد
یونایتدتکنولوژی
سومیتوموالکتریک
چایناالکترونیکس
گهردورودلرستان
لانگبرگرکمپانی
اشنایدرالکتریک
کوانتاکامپیوتر
مگنااینترنشنال
یارااینترنشنال
پروکتراندگمبل
وکتورمارکتینگ
لاریسیناانرژی
نیوزکورپوریشن
برکشایرهاتاوی
فیسکرآتوموتیو
استاندارداویل
پتروقزاقستان
بارنزاندنوبل
دبلیودبلیوای
آذرکوثرتبریز
البدربندرکنگ
فولادخوزستان
کونوکوفیلیپس
دلتاایرلاینز
سانتاندرگروپ
لاکهیدمارتین
کلمبیارکوردز
کلمبیاپیکچرز
بانکوبیلبائو
تراکتورسازی
پترواکوادور
اسکوشیابانک
بیوپرفورمنس
نالکورانرژی
سانکورانرجی
سیسکوسیستمز
اسکوئرانیکس
بنیادموزیلا
آرسلورمیتال
انگلوامریکن
پرنودریکارد
الکترولوکس
مایکروسافت
پتروویتنام
پژوسیتروئن
کونتیننتال
فلکسترونیک
نوونوردیسک
اتکاگلستان
الوندهمدان
کشاورزآلنی
سرداربوکان
سایپاتهران
سپیدرودرشت
کوثرلرستان
فاندآمریکا
والکوانرژی
کنیاایرویز
تاتاموتورز
والروانرژی
تسلاموتورز
والروانرجی
کومودوگروپ
ایرلیکوئید
استوراانسو
کاترپیلار
کوگنیزانت
هالیبرتون
لوکساتیکا
پاناسونیک
استارباکس
ترافیگورا
بلاکباستر
ماکرومدیا
ایبردرولا
آسترازنکا
تلیاسونرا
میتسوبیشی
کیاموتورز
سازمان3ام
فابرکاستل
فولادنطنز
فائولینکس
گرکاانرژی
آسیاپینتس
داوکمیکال
سیکواپسون
گودیرتایر
تاتااستیل
فایولینکس
سازمان۳ام
پرسپولیس
فجرسپاسی
هربالایف
اوریفلیم
پریمریکا
گلدکوئست
سانرایدر
پتروبراس
اکوپترول
پتروترین
آنادارکو
ایرفرانس
آکزونوبل
بمباردیه
بریجستون
کوکاکولا
اینفوسیس
موتورولا
مونسانتو
پارمالات
شلومبرجر
تلفونیکا
یونیلیور
لینکداین
زایلینکس
اکستراتا
اسبربانک
سومیتومو
لسترسیتی
سیورستال
سالزگیتر
کارلزبرگ
دایملرآگ
چوکاتالش
فولادیزد
شهرباران
پامپردچف
سهندآسیا
فیلیپس66
ولزفارگو
برگرکینگ
پیتزاهات
ویزاکارت
ریوتینتو
فیلیپس۶۶
ملالوکا
ویسالوس
ایکوموس
سینکرود
پتروپرو
آلیانتس
باکاردی
امبرائر
اریکسون
فوجیتسو
گازپروم
ایندزیت
کوماتسو
لاگاردر
لکسمارک
نینتندو
نوارتیس
پتروناس
وودافون
ویرلپول
ساینوپک
کرایسلر
دیلاردز
گیتورید
انویدیا
بارکلیز
میتسویی
هیوسانگ
سنتریکا
سامسونگ
مخابرات
نورینکو
سینوماک
اینیوس*
فرزنیوس
سینگنتا
شرکت3ام
یزدلوله
مونووای
شرکت۳ام
سپاهان
کاسپین
کلینیز
آیسسکو
ایکائو
یونسکو
یونیدو
انارسا
انکانا
اکسنچر
ایرباس
آلستوم
آلتریا
جنرالی
بوئینگ
کاستکو
کامینز
دایکین
دیلویت
هیتاچی
ایسوزو
کونامی
لورئال
اوراکل
فیلیپس
سبمیلر
سانوفی
توشیبا
تویوتا
گلنکور
کارگیل
ورایزن
کارفور
گارتنر
کنوورث
ریتیون
زیراکس
اتودسک
سیمنتک
توئیتر
نوردیا
ویوندی
فرکوبه
سینوکم
دوپونت
اینیوس
سوزوکی
هولسیم
وولزلی
لافارژ
آدیداس
سافران
آروبیس
دیاجیو
سندویک
ودانتا
لانکسس
تناریس
توییتر
آدووکر
نیوویز
گروه14
گروه20
بایرآگ
کاگیمز
متروآگ
گروه۱۴
گروه۲۰
هوآوی
سایپا
امسیل
ریلیو
سنتسی
شیکلی
زانگو
جایکا
فیاتا
شورون
آتاری
بوویگ
دانون
گرداو
هیلتی
هوندا
آیکیا
اینتل
میشلن
موبیل
نستله
نایکی
نیسان
فایزر
ردبول
رپسول
روسال
ساسول
زیمنس
توتال
ویپرو
ویتول
گایکو
ورتکس
ادوبی
کامپک
بیمبو
آویوا
وینچی
آیفکس
لینده
سوجیت
نوکیا
ایگون
اکسور
پوسکو
سابیک
سیسکو
کوفکو
هینکن
اوراز
سولوی
ایتون
سیگیت
والئو
داعش
اوپو
ویوو
فیفا
فیبا
فیلا
منتچ
اوپک
یاتا
نکسن
کوپت
پمکس
آنکپ
آکور
آکسا
کانن
فورد
ژیلت
گوگل
کنور
لنوو
ریکو
سیرز
سونی
تسکو
فیات
ردهت
یاهو
باسف
بیجی
ولوو
بیتی
دنسو
شارپ
مزدا
هنکل
تالس
دلفی
میچل
وما
بیک
متل
رنو
اپل
ورزشگاه۱۹سپتامبراردو
ورزشگاه۴سپتامبرسیواس
کشورآنتیگواوباربودا
کشورترینیدادوتوباگو
بنیادشهیددکتربهشتی
شهرمحمودآبادنمونه
شهرچادگان و بوئین
مسجدامیرالمومنین
کشورجزایرفالکلند
شهرشهرلوکزامبورگ
کشورترانسنیستریا
شهرآندورالاوللا
کشورجزایرمارشال
کشورجزایرسلیمان
آنتیگواوباربودا
ترینیدادوتوباگو
شهرسانتودومینگو
شهرنورآبادممسنی
مسجدسیدعزیزالله
کشوربورکینافاسو
شهرگواتمالاسیتی
مسجدابوالفضلیون
محمودآبادنمونه
مسجدعلمدارحسین
شهررودبارزیتون
سینماشهیدچمران
مسجدسیدالشهداء
مسجدباقرالعلوم
کشورالسالوادور
کشورلوکزامبورگ
کشورماداگاسکار
کشورنیکاراگوئه
شهرکوالالامپور
شهراحمدسرگوراب
مسجدسیدالشهدا
کشورتیمورشرقی
کشورکشمیرآزاد
کشورجزایرکیمن
شهربندرماهشهر
شهررودبارجنوب
شهرپاناماسیتی
شهربندرآستارا
شهرمسجدسلیمان
کشورافغانستان
کشوربلغارستان
کشورکاستاریکا
کشورقرقیزستان
کشورتاجیکستان
کشورترکمنستان
کشورپورتوریکو
شهرسنقرکلیایی
شهرفریدونکنار
شهراولانباتار
شهربراتیسلاوا
شهرپاراماریبو
شهرتکوسیگالپا
شهرلوکزامبورگ
شهرابوزیدآباد
شهرورنامخواست
شهراختیارآباد
شهرچالانچولان
سینماتیراژه2
سینماتیراژه۲
ترانسنیستریا
گواتمالاسیتی
مسجدمرکزبسیج
کشورجزایرکوک
آندورالاوللا
شهربندربوشهر
شهربندرکنگان
شهرانبارآلوم
شهرکبودرآهنگ
شهربندرانزلی
شهرگنبدکاووس
شهربندرترکمن
شهرگنبدقابوس
شهرمحمودآباد
شهرپورتونووو
شهربندرگناوه
سینماعصرجدید
مسجدابوالفضل
کشورآرژانتین
کشورارمنستان
کشوراسترالیا
کشورباربادوس
کشوربوتسوانا
کشوردومینیکا
کشورگواتمالا
کشورمجارستان
کشورجامائیکا
کشورقزاقستان
کشورکیریباتی
کشورموریتانی
کشورمغولستان
کشورموزامبیک
کشورکوراسائو
کشورنیوزیلند
کشورپاراگوئه
کشورسیرالئون
کشورسریلانکا
کشورسوازیلند
کشورتانزانیا
کشوربریتانیا
کشورمونتسرات
کشورازبکستان
کشورزیمبابوه
جزایرفالکلند
شهرهمایونشهر
شهراورامانات
شهرفریدونشهر
شهرفیروزآباد
شهرچاراویماق
شهربوغداکندی
شهراوآگادوگو
شهربوجومبورا
شهرلیوبلیانا
شهرموناکوویل
شهرنوکوآلوفا
شهریائواونده
سانتودومینگو
شهراروندکنار
شهرعلامرودشت
شهرایزدخواست
شهربابارشانی
شهرسرخنکلاته
شهربازارجمعه
نورآبادممسنی
مسجدابوالصدق
سینمااستقلال
سینماماندانا
بورکینافاسو
کوالالامپور
احمدسرگوراب
برخوارومیمه
شهرپورتونوو
شهربندردیلم
شهرمشهدمقدس
شهرشهررویدر
شهرقصرشیرین
شهراحمدآباد
شهرخالدآباد
شهربندرلنگه
شهربندرعباس
شهرمحمدآباد
شهربندرچارک
شهربندرخمیر
خوروبیابانک
کشورالجزایر
کشوربنگلادش
کشورمیانمار
کشوربوروندی
کشوردانمارک
کشوراکوادور
کشورگرجستان
کشورهندوراس
کشوراندونزی
کشوراسرائیل
کشورایتالیا
کشورلیتوانی
کشورمولداوی
کشورنامیبیا
کشورتوکلائو
کشورپاکستان
کشورفیلیپین
کشورصربستان
کشورسنگاپور
کشوراسلواکی
کشوراسلوونی
کشوراسپانیا
کشورسورینام
کشوراوگاندا
کشوراوکراین
کشورآنگویلا
کشوراروگوئه
کشوروانواتو
کشورواتیکان
کشورونزوئلا
جزایرمارشال
کشورعربستان
جزایرسلیمان
شهررودباران
شهرشمیرانات
شهرتویسرکان
شهرمیاندوآب
شهرپیرانشهر
شهرفلاورجان
شهرالیگودرز
شهرکرمانشاه
شهرایرانشهر
شهرکهگیلویه
شهررضوانشهر
شهربویراحمد
شهرکامیاران
شهرگیلانغرب
شهرفیروزکوه
شهرعنبرآباد
شهرکهکیلویه
شهرپاسارگاد
شهرزرتشتیان
شهربهارستان
شهرخداآفرین
شهرخاروانای
شهرگلپایگان
شهرساوجبلاغ
شهرمیاندورد
شهرآمستردام
شهرآسونسیون
شهربرازاویل
شهربرازیلیا
شهرسائوتومه
شهرسانتیاگو
شهرفونافوتی
شهرکاتماندو
شهرکینگستون
شهرلیلونگوه
شهرمانروویا
شهرموگادیشو
شهراصلاندوز
شهرخوراسگان
شهرطالخونچه
شهرکهریزسنگ
شهردوزدوزان
شهرگردکشانه
شهرایواوغلی
شهرشبانکاره
شهرفرهادگرد
شهرباجگیران
شهرشهمیرزاد
شهرکامفیروز
شهرکنارتخته
شهراسفرورین
شهرجبالبارز
شهراندوهجرد
شهردوگنبدان
شهرکوچصفهان
شهرواجارگاه
شهرزرگرمحله
شهرکلارآباد
رودبارزیتون
شهرکُشکسرای
مسجدالمتقین
مسجدثارالله
سینماآستارا
سینماآفریقا
سینمابولوار
سینماپایتخت
سینمامگامال
سینماجمهوری
سینماسمرقند
سینمافردوسی
سینمافلسطین
مسجدالمهدی
السالوادور
لوکزامبورگ
ماداگاسکار
نیکاراگوئه
سنقرکلیایی
مسجدسلیمان
فریدونکنار
اولانباتار
براتیسلاوا
پاراماریبو
تکوسیگالپا
اختیارآباد
چالانچولان
بندرماهشهر
رودبارجنوب
مسجدالهادی
مسجدیاحسین
شهربندردیر
شهرحرریاحی
شهرشهربابک
شهرنظرآباد
شهربندرریگ
کشورآمریکا
شهرنیویورک
کشورآلبانی
کشورآندورا
کشورآنگولا
کشورباهاما
کشوربلاروس
کشوربولیوی
کشوربرونئی
کشورکامبوج
کشورکامرون
کشورکانادا
کشورکلمبیا
کشورکرواسی
کشورجیبوتی
کشوراریتره
کشوراستونی
کشوراتیوپی
کشورفنلاند
کشورفرانسه
کشورگامبیا
کشورگرنادا
کشورهائیتی
کشورایسلند
کشورلیبریا
کشورمالاوی
کشورمالدیو
کشورموناکو
کشورنائورو
کشورنیجریه
کشورپالائو
کشورپاناما
کشورلهستان
کشورپرتغال
کشوررومانی
کشوررواندا
کشورسومالی
کشورتایلند
کشورتووالو
کشوربرمودا
کشورآلدرنی
کشورویتنام
کشورزامبیا
کشورامارات
شهراسفراین
شهرماهنشان
شهرخاروانا
شهرمینودشت
شهررامهرمز
شهرمیرجاوه
شهردشتستان
شهرخدابنده
شهراردستان
شهرنیشابور
شهراستهبان
شهرسروستان
شهرتاکستان
شهراندیمشک
شهرگچساران
شهرسوادکوه
شهرگاوبندی
شهرلارستان
شهررفسنجان
شهرلاهیجان
شهرجوانرود
شهرخوانسار
شهررشتخوار
شهرآبدانان
شهراسدآباد
شهرنهبندان
شهراشتهارد
شهرهندیجان
شهرابوموسی
شهرارسنجان
شهرلاریجان
شهرتنگستان
شهرچالدران
شهرپارسیان
شهرسروآباد
شهرآزادشهر
شهرکلیمیان
شهربیابانک
شهرمهدیشهر
شهرارزوئیه
شهرملکشاهی
شهرمیاندشت
شهرنرماشیر
شهرفراشبند
شهرچایپاره
شهربینالود
شهرآغاجاری
شهرمهرستان
شهرنورآباد
شهرکوهبنان
شهررومشکان
شهرکلاردشت
شهراستکهلم
شهراسکوپیه
شهرالجزیره
شهرانجامنا
شهربانکوئی
شهربلموپان
شهربوداپست
شهرپالیکیر
شهرپرتوریا
شهرجاکارتا
شهرسارایوو
شهرسنگاپور
شهرکاراکاس
شهرکامپالا
شهرکوناکری
شهرکینشازا
شهرگابورون
شهرلوبامبا
شهرماناگوآ
شهرنایروبی
شهرنوآکشوت
شهرنیکوزیا
شهرهلسینکی
شهرهونیارا
شهرهندوراس
شهرواتیکان
شهرویلنیوس
شهرویندهوک
پاناماسیتی
شهرآبچوئیه
شهرکوهپایه
شهرچمگردان
شهرزیباشهر
شهرچهارباغ
شهرمحمدشهر
شهرکمالشهر
شهرشرفخانه
شهرخسروشهر
شهرهادیشهر
شهرشندآباد
شهرکشکسرای
شهرذوالبین
شهربازرگان
شهرسیلوانه
شهرمیرآباد
شهرمحمدیار
شهربرازجان
شهرسعدآباد
شهربردستان
شهرباقرشهر
شهرباغستان
شهرنصیرشهر
شهرشاهدشهر
شهرفردوسیه
شهرفرادنبه
شهرسفیددشت
شهرسورشجان
شهراسلامیه
شهرنوخندان
شهرنصرآباد
شهرسنخواست
شهرسوسنگرد
شهرمینوشهر
شهرمیانرود
شهرایوانکی
شهرگلمورتی
شهربنارویه
شهرزیدآباد
شهرباینگان
شهرکفشکنان
شهرلوندویل
شهرتوتکابن
شهرمعمولان
شهررستمکلا
شهردابودشت
شهرامیرشهر
شهرمرزیکلا
شهرنشتارود
شهرایزدشهر
شهرضامنجان
شهرمامونیه
شهرفیروزان
شهرمهاجران
بندرآستارا
مسجدالکریم
مسجدالکوثر
مسجدپیامبر
مسجدزینبیه
تالارفرهنگ
سینماآزادی
سینمااریکه
سینماتماشا
سینماچارسو
سینمازندگی
سینماشکوفه
سینماکوروش
سینماتهران
سینماسپیده
سینمافرهنگ
سینماکارون
سینمامیلاد
سینمامرکزی
سینماناهید
مسجدالنبی
مسجدالرضا
افغانستان
بلغارستان
کاستاریکا
قرقیزستان
تاجیکستان
ترکمنستان
پورتوریکو
همایونشهر
کبودرآهنگ
بندرانزلی
محمودآباد
اورامانات
فریدونشهر
فیروزآباد
گنبدکاووس
بندرترکمن
گنبدقابوس
چاراویماق
بوغداکندی
اوآگادوگو
بوجومبورا
لیوبلیانا
موناکوویل
نوکوآلوفا
یائواونده
اروندکنار
علامرودشت
ایزدخواست
بابارشانی
سرخنکلاته
بازارجمعه
شهرشهرخنج
شهرشهرکنگ
شهرشهرکیش
شهرآذرشهر
شهربندرگز
مسجدالزهر
شهرشیکاگو
کشوراتریش
کشوربحرین
کشوربلژیک
کشوربرزیل
کشورکومور
کشورگابون
کشورآلمان
کشوریونان
کشورگویان
کشورایران
کشورلائوس
کشورلتونی
کشورلبنان
کشورلسوتو
کشورمالزی
کشورموریس
کشورمکزیک
کشورمراکش
کشورآروبا
کشورنیووی
کشورروسیه
کشورساموآ
کشورسنگال
کشورسودان
کشورسوئیس
کشورسوریه
کشورتونگا
کشورترکیه
کشورگرنزی
کشورآبخاز
کشورکوزوو
تیمورشرقی
کشمیرآزاد
جزایرکیمن
شهرآشتیان
شهرسیرجان
شهرچابهار
شهرشهرکرد
شهرورامین
شهردماوند
شهراصفهان
شهربرخوار
شهرسبزوار
شهربروجرد
شهرهشترود
شهرزاهدان
شهربجنورد
شهرآستارا
شهرسراوان
شهرکوهدشت
شهرمهاباد
شهراردبیل
شهرورزقان
شهرشاهرود
شهربیرجند
شهرلردگان
شهراردکان
شهرکنگاور
شهرکردکوی
شهرتایباد
شهرتنکابن
شهردهلران
شهرلنگرود
شهرارومیه
شهررامیان
شهرخرمشهر
شهرشادگان
شهرآبادان
شهرفریمان
شهرمرودشت
شهررودبار
شهرچناران
شهرکازرون
شهربابلسر
شهرشهریار
شهردلیجان
شهرقاینات
شهرمریوان
شهرجابهار
شهرسپیدان
شهرخروانق
شهرگرمسار
شهرچادگان
شهرنهاوند
شهربردسکن
شهربهبهان
شهرجویبار
شهرشیروان
شهرگناباد
شهرباغملک
شهرخرمدره
شهرمبارکه
شهرچرداول
شهربوانات
شهرخرمبید
شهرسربیشه
شهرسرایان
شهربشرویه
شهربادرود
شهرطرقرود
شهراشنویه
شهرسملقان
شهربردسیر
شهرفراهان
شهرامیدیه
شهردامغان
شهربیستون
شهرپلدختر
شهرپاکدشت
شهرچاروسا
شهرابرکوه
شهربجستان
شهرکمیجان
شهرفارسان
شهرکوهرنگ
شهرسیاهکل
شهرمنوجان
شهردرمیان
شهرزرندیه
شهرفامنین
شهرگلوگاه
شهرهوراند
شهراندیکا
شهردهگلان
شهرامیریه
شهرفیروزه
شهرهیرمند
شهرایجرود
شهربشاگرد
شهررامشیر
شهرگالیکش
شهردهاقان
شهرگمیشان
شهرفاریاب
شهرطالقان
شهرکارزین
شهرحمیدیه
شهرروانسر
شهرعسلویه
شهرجرگلان
شهرماهشهر
شهرآرادان
شهرقصرقند
شهرنیمروز
شهردالاهو
شهرکلیایی
شهربهاباد
شهرابوظبی
شهرایروان
شهرآبیجان
شهرآستانه
شهرآنکارا
شهرآوکلند
شهرباماکو
شهربانجول
شهربانکوک
شهربخارست
شهربروکسل
شهربلگراد
شهربوگوتا
شهربیسایو
شهرتاشکند
شهرتیرانا
شهرجیبوتی
شهرخارطوم
شهردوبلین
شهردودوما
شهردوشنبه
شهرطرابلس
شهرکانبرا
شهرکپنهاگ
شهرکیشینف
شهرکیگالی
شهرلوآندا
شهرلوساکا
شهرلیسبون
شهرماپوتو
شهرماجورو
شهرمادرید
شهرمالابو
شهرمکزیکو
شهرمورونی
شهرهاوانا
شهرعنبران
شهردیزیچه
شهرابریشم
شهرخورزوق
شهرهشتگرد
شهرکوهسار
شهرماهدشت
شهرگرمدره
شهرموسیان
شهرخمارلو
شهرصوفیان
شهرایلخچی
شهرباسمنج
شهرسردرود
شهرشربیان
شهرمهربان
شهروایقان
شهربخشایش
شهرسیمینه
شهرکشاورز
شهرآواجیق
شهرفیرورق
شهروحدتیه
شهرخورموج
شهربردخون
شهرگلستان
شهروحیدیه
شهراندیشه
شهرلواسان
شهرزردبند
شهرصباشهر
شهرارجمند
شهرگندمان
شهرجونقان
شهربلداجی
شهرسودجان
شهرهفشجان
شهرشلمزار
شهرقدمگاه
شهرداورزن
شهرشاندیز
شهرچاپشلو
شهرشادمهر
شهرآشخانه
شهرسهرورد
شهردرجزین
شهراشکنان
شهرسوریان
شهرخاوران
شهربالاده
شهرقائمیه
شهرخاکعلی
شهردستجرد
شهربزنجان
شهربهرمان
شهرگهواره
شهرکوزران
شهرپاتاوه
شهردیشموک
شهرنوکنده
شهرچابکسر
شهررودبنه
شهرمارلیک
شهرجیرنده
شهراطاقور
شهرفرزیان
شهرویسیان
شهرکونانی
شهرشیرگاه
شهرچمستان
شهرفرمهین
شهرانجدان
شهرکرهرود
شهررازقان
شهرنوبران
شهردرگهان
شهرلالجین
شهرقهاوند
شهرمهردشت
انبارآلوم
شهرقائنات
شهرکلیائی
پورتونووو
کشوربوسنی
مسجدفرشته
مسجدتجریش
مسجدگیاهی
مسجدریحان
مسجدحائری
مسجدمحمدی
تئاترپارس
سینمابهمن
سینماپارس
سینمارازی
سینماراگا
سینماکیان
سینماقلهک
سینماپیام
سینماحافظ
سینماسروش
سینماسعدی
سینماشاهد
سینماصحرا
کرمانشاه
مازندران
آرژانتین
ارمنستان
استرالیا
باربادوس
بوتسوانا
دومینیکا
گواتمالا
مجارستان
جامائیکا
قزاقستان
کیریباتی
موریتانی
مغولستان
موزامبیک
کوراسائو
نیوزیلند
پاراگوئه
سیرالئون
سریلانکا
سوازیلند
تانزانیا
بریتانیا
مونتسرات
ازبکستان
زیمبابوه
هندوستان
رودباران
شمیرانات
تویسرکان
میاندوآب
پیرانشهر
اسلامشهر
بندرعباس
فلاورجان
الیگودرز
قصرشیرین
بندرلنگه
ایرانشهر
کهگیلویه
رضوانشهر
بویراحمد
دیواندره
کامیاران
احمدآباد
گیلانغرب
خالدآباد
فیروزکوه
عنبرآباد
کهکیلویه
پاسارگاد
خداآفرین
خاروانای
گلپایگان
ساوجبلاغ
میاندورد
آمستردام
آسونسیون
برازاویل
برازیلیا
سائوتومه
سانتیاگو
فونافوتی
کاتماندو
کینگستون
لیلونگوه
مانروویا
موگادیشو
باجگیران
شهمیرزاد
محمدآباد
کامفیروز
کنارتخته
اسفرورین
جبالبارز
اندوهجرد
دوگنبدان
کوچصفهان
واجارگاه
زرگرمحله
کلارآباد
بندرچارک
بندرخمیر
سینماملت
پورتونوو
شهردررود
شهرشهرری
کشوربلیز
کشوربنین
کشورشیلی
کشورکوبا
کشورقبرس
کشورفیجی
کشورگینه
کشورعراق
کشورژاپن
کشوراردن
کشورکنیا
کشورکویت
کشورلیبی
کشورمالی
کشورمالت
کشورنپال
کشورهلند
کشورنیجر
کشورنروژ
کشورعمان
کشورسیشل
کشورسوئد
کشورتوگو
کشورتونس
کشورسارک
کشورجرسی
کشورگوآم
جزایرکوک
شهرشوشتر
شهرتهران
شهرقزوین
شهرجیرفت
شهراهواز
شهرملکان
شهرنوشهر
شهرکاشان
شهردورود
شهرکرمان
شهرسمیرم
شهرکلیبر
شهرکهنوج
شهرتبریز
شهرشهرضا
شهرشبستر
شهرملایر
شهرمراغه
شهراقلید
شهرسمنان
شهرمیانه
شهربروجن
شهرهمدان
شهربهشهر
شهربیجار
شهرملاوی
شهررامسر
شهربوکان
شهرممسنی
شهرقوچان
شهرشیراز
شهرکاشمر
شهرسنندج
شهرسربند
شهرسردشت
شهرایلام
شهرداراب
شهرطرقبه
شهربندپی
شهرسلماس
شهرمحلات
شهرآباده
شهرفردوس
شهرزنجان
شهرهرسین
شهرمهران
شهرلامرد
شهرالشتر
شهردلفان
شهرخرامه
شهرکربال
شهرنائین
شهرشازند
شهرسلسله
شهرلنجان
شهرفریدن
شهردزفول
شهررودسر
شهرخلخال
شهرماسال
شهررضویه
شهرکنگان
شهرجاجرم
شهرایوان
شهربوشهر
شهرگناوه
شهرتیران
شهرکلاله
شهردهدشت
شهربهمئی
شهرمهریز
شهررودان
شهرمیناب
شهرالبرز
شهرسرباز
شهرلاشار
شهرهفتگل
شهردینور
شهرسامان
شهرگتوند
شهرگرگان
شهرهفتکل
شهرملارد
شهرکورین
شهرقلتوق
شهرجفتای
شهرخوشاب
شهرپیشوا
شهرسیریک
شهربهمنی
شهرخنداب
شهربیدگل
شهرباخزر
شهرچالوس
شهرپلدشت
شهرترکمن
شهردلگان
شهرسرعین
شهرریگان
شهرهویزه
شهرفاروج
شهرسوران
شهرزابلی
شهرکنارک
شهرفردیس
شهرپردیس
شهرباخرز
شهرجغتای
شهرکارون
شهرهامون
شهربویین
بندردیلم
شهراتاوا
شهراربیل
شهرآبوجا
شهربرلین
شهربغداد
شهربیروت
شهربیشکک
شهرپاریس
شهرپرایا
شهرتالین
شهرتایپه
شهرتفلیس
شهرتوکیو
شهرتیمفو
شهرداکار
شهرزاگرب
شهرصوفیه
شهرقاهره
شهرکلمبو
شهرلاپاز
شهرماسرو
شهرمانیل
شهرمنامه
شهرمینسک
شهرنیامی
شهرهانوی
شهروادوز
شهروالتا
شهرنیاسر
شهرتودشک
شهرکمشجه
شهرگلشهر
شهرآسارا
شهرخراجو
شهرممقان
شهرگوگان
شهرخامنه
شهریامچی
شهرلیلان
شهرآقکند
شهرخواجه
شهرباروق
شهرنالوس
شهرچغادک
شهردلوار
شهرآبپخش
شهردالکی
شهرآبدان
شهرطاهری
شهررودهن
شهرآبعلی
شهرکیلان
شهرچلگرد
شهرناغان
شهرآلونی
شهراسفدن
شهربیدخت
شهرسلامی
شهرکاریز
شهرانابد
شهررودآب
شهرلوجلی
شهرصیدون
شهرچمران
شهرقیدار
شهربسطام
شهربمپور
شهربزمان
شهرادیمی
شهربنجار
شهرپیشین
شهراسپکه
شهرمیمند
شهرسورمق
شهرنودان
شهروراوی
شهرالوند
شهرارداق
شهرکوهین
شهرزرینه
شهرشویشه
شهرچناره
شهربروات
شهرپاریز
شهرجوپار
شهرباغین
شهرشهداد
شهرچترود
شهرگلزار
شهرمردهک
شهرسومار
شهرسرمست
شهرنودشه
شهرنوسود
شهرازگله
شهریاسوج
شهرچیتاب
شهرمنجیل
شهرهشتپر
شهراسالم
شهرلیسار
شهرلوشان
شهرمرجغل
شهرشلمان
شهرآلاشت
شهرکیاسر
شهررویان
شهربازنه
شهرسنجان
شهرفیجان
شهرزاویه
شهرپرندک
شهرسندرک
شهرفرسفج
شهرزنگنه
شهربرزول
شهرندوشن
شهردیهوک
شهرمروست
شهررویدر
شهرنایین
شهربوئین
شهرعَمان
شهرآیَسک
شهراِوَز
شهرکَوار
شهراَهِل
مسجدعلوی
مسجدبلال
مسجدوحدت
تئاترنصر
سینماقدس
روتردام
نیویورک
خوزستان
کردستان
هرمزگان
الجزایر
بنگلادش
میانمار
بوروندی
دانمارک
اکوادور
گرجستان
هندوراس
اندونزی
اسرائیل
ایتالیا
لیتوانی
مولداوی
نامیبیا
توکلائو
پاکستان
فیلیپین
عربستان
صربستان
سنگاپور
اسلواکی
اسلوونی
اسپانیا
سورینام
اوگاندا
اوکراین
آنگویلا
اروگوئه
وانواتو
واتیکان
ونزوئلا
شهربابک
اسفراین
ماهنشان
خاروانا
مینودشت
رامهرمز
میرجاوه
دشتستان
خدابنده
اردستان
نیشابور
استهبان
سروستان
قائمشهر
تاکستان
اندیمشک
گچساران
سوادکوه
گاوبندی
لارستان
رفسنجان
لاهیجان
جوانرود
خوانسار
رشتخوار
آبدانان
اسدآباد
نهبندان
اشتهارد
هندیجان
ابوموسی
ارسنجان
لاریجان
تنگستان
چالدران
سروآباد
آزادشهر
کلیمیان
بیابانک
مهدیشهر
ارزوئیه
ملکشاهی
میاندشت
نظرآباد
نرماشیر
فراشبند
چایپاره
بینالود
آغاجاری
مهرستان
نورآباد
کوهبنان
رومشکان
کلاردشت
استکهلم
اسکوپیه
الجزیره
انجامنا
بانکوئی
بلموپان
بوداپست
پالیکیر
پرتوریا
جاکارتا
سارایوو
کاراکاس
کامپالا
کوناکری
کینشازا
گابورون
لوبامبا
ماناگوآ
نایروبی
نوآکشوت
نیکوزیا
هلسینکی
هونیارا
ویلنیوس
ویندهوک
سنخواست
سوسنگرد
مینوشهر
میانرود
ایوانکی
گلمورتی
بنارویه
زیدآباد
باینگان
کفشکنان
لوندویل
توتکابن
معمولان
رستمکلا
دابودشت
امیرشهر
مرزیکلا
نشتارود
ایزدشهر
ضامنجان
مامونیه
فیروزان
شهررابر
کشورچاد
کشورچین
کشورمصر
کشورغنا
کشورهند
کشورپرو
کشورقطر
کشورهرم
کشوریمن
شهرتفرش
شهرمشهد
شهرساری
شهربناب
شهربهار
شهرزرند
شهرازنا
شهرجهرم
شهرپاوه
شهرخواف
شهرزابل
شهربافت
شهرنقده
شهرماکو
شهردرگز
شهربانه
شهرمغان
شهرشهری
شهربابل
شهرایذه
شهرفومن
شهرسرخس
شهرمرند
شهرقمصر
شهرنطنز
شهرابهر
شهرسراب
شهراراک
شهرصحنه
شهرطارم
شهرمیمه
شهربستک
شهرهریس
شهرجلفا
شهرخمین
شهرتالش
شهرتکاب
شهرساوه
شهرقروه
شهرآبیک
شهراسکو
شهراملش
شهرصدوق
شهرکرون
شهرنمین
شهرمانه
شهرکلات
شهرکوار
شهرچرام
شهربافق
شهرخاتم
شهراردل
شهرکیار
شهرکوثر
شهرجاسک
شهرگرمی
شهردشتی
شهرگراش
شهرلالی
شهردوره
شهرخمیر
شهرزاوه
شهرانار
شهرجوین
شهرمیبد
شهرباوی
شهردرود
شهرآران
شهردیلم
شهرسرخه
شهرباشت
شهرگرمه
شهرسنقر
شهرراور
شهرفنوج
شهرآشار
شهرفهرج
شهررستم
شهراسلو
شهرآپیا
شهرآکرا
شهرباکو
شهرپراگ
شهرتونس
شهرداکا
شهردمشق
شهردوحه
شهردیلی
شهررباط
شهرروسو
شهرریاض
شهرریگا
شهرسئول
شهرسووا
شهرصنعا
شهرعمان
شهرکابل
شهرکویت
شهرکیتو
شهرلندن
شهرلومه
شهرلیما
شهرماله
شهرمسقط
شهرمسکو
شهرورشو
شهرگوگد
شهرزاغل
شهراژیه
شهرپهله
شهرسهند
شهرزنوز
شهرتسوج
شهرزرنق
شهرخارک
شهراهرم
شهرکلمه
شهرشنبه
شهرکاکی
شهرقرچک
شهرنافچ
شهرگهرو
شهرقاین
شهرآیسک
شهرشوسف
شهرطارق
شهرکاخک
شهربایگ
شهرچکنه
شهردندی
شهرسجاس
شهرنگور
شهرجالق
شهرراسک
شهربیرم
شهربهمن
شهرصغاد
شهرششده
شهرنرجه
شهرصاحب
شهرراین
شهرنودژ
شهرهلشی
شهرلیکک
شهرلنده
شهردلند
شهرچوبر
شهرزاغه
شهرگراب
شهرگزنک
شهربلده
شهرگتاب
شهرفریم
شهرنراق
شهرتوره
شهرلنگه
شهرجناح
شهرگیان
شهرسامن
حرریاحی
شهرقائن
شهرمُهر
مسجدقدس
مسجدقبا
مسجدارک
سینماجی
شیکاگو
اردبیل
اصفهان
گلستان
لرستان
آلبانی
آندورا
آنگولا
باهاما
بلاروس
بولیوی
برونئی
کامبوج
کامرون
کانادا
کلمبیا
کرواسی
جیبوتی
اریتره
استونی
اتیوپی
فنلاند
فرانسه
گامبیا
گرنادا
هائیتی
ایسلند
لیبریا
مالاوی
مالدیو
موناکو
نائورو
نیجریه
پالائو
پاناما
لهستان
پرتغال
رومانی
رواندا
سومالی
تایلند
تووالو
امارات
برمودا
آلدرنی
ویتنام
زامبیا
شهرمهر
آشتیان
سیرجان
چابهار
شهرکرد
ورامین
دماوند
برخوار
سبزوار
بروجرد
هشترود
زاهدان
بجنورد
آستارا
سراوان
کوهدشت
مهاباد
ورزقان
شاهرود
بیرجند
لردگان
اردکان
کنگاور
کردکوی
تایباد
تنکابن
دهلران
لنگرود
ارومیه
رامیان
خرمشهر
شادگان
آبادان
فریمان
مرودشت
رودبار
چناران
کازرون
بابلسر
دلیجان
قاینات
مریوان
جابهار
سپیدان
خروانق
گرمسار
چادگان
نهاوند
بردسکن
بهبهان
جویبار
شیروان
گناباد
باغملک
آذرشهر
خرمدره
چرداول
بوانات
خرمبید
سربیشه
سرایان
بشرویه
نیکشهر
بندرگز
بادرود
طرقرود
اشنویه
سملقان
بردسیر
فراهان
امیدیه
دامغان
بیستون
پلدختر
پاکدشت
چاروسا
ابرکوه
بجستان
کمیجان
فارسان
کوهرنگ
سیاهکل
منوجان
زرندیه
فامنین
هوراند
اندیکا
دهگلان
امیریه
هیرمند
ایجرود
بشاگرد
رامشیر
گالیکش
دهاقان
گمیشان
فاریاب
طالقان
کارزین
حمیدیه
روانسر
عسلویه
جرگلان
ماهشهر
آرادان
قصرقند
دالاهو
کلیایی
بهاباد
ابوظبی
ایروان
آبیجان
آنکارا
آوکلند
باماکو
بانجول
بانکوک
بخارست
بروکسل
بلگراد
بوگوتا
بیسایو
تاشکند
تیرانا
خارطوم
دوبلین
دودوما
طرابلس
کانبرا
کپنهاگ
کیشینف
کیگالی
لوآندا
لوساکا
لیسبون
ماپوتو
ماجورو
مادرید
مالابو
مکزیکو
مورونی
هاوانا
چاپشلو
شادمهر
آشخانه
سهرورد
درجزین
اشکنان
سوریان
خاوران
بالاده
قائمیه
خاکعلی
دستجرد
بزنجان
بهرمان
گهواره
کوزران
پاتاوه
دیشموک
نوکنده
چابکسر
رودبنه
مارلیک
جیرنده
اطاقور
فرزیان
ویسیان
کونانی
شیرگاه
چمستان
فرمهین
انجدان
کرهرود
رازقان
نوبران
درگهان
لالجین
قهاوند
مهردشت
قائنات
کلیائی
آمریکا
پامنار
شهررزن
شهرفسا
شهریزد
شهررشت
شهرنور
شهرآوج
شهرسقز
شهرخاش
شهرکرج
شهرشوش
شهرآمل
شهرطبس
شهراهر
شهرحلب
شهرخوی
شهرشفت
شهردیر
شهرنیر
شهرنکا
شهرقشم
شهرخنج
شهربنت
شهرقدس
شهرزهک
شهرتفت
شهرخور
شهردنا
شهرشوط
شهرقیر
شهرسیب
شهرراز
شهرآتن
شهربرن
شهرپکن
شهرکیف
شهرنوک
شهروین
شهردهق
شهرکمه
شهرسیس
شهرسرو
شهرریز
شهربنک
شهرفشم
شهرخرو
شهردرق
شهرمجن
شهرلار
شهراوز
شهرخشت
شهراهل
شهرشال
شهردهج
شهرسطر
شهرسوق
شهرفین
شهرکنگ
شهرکیش
بالکان
انگلیس
البرز
ایلام
بوشهر
تهران
زنجان
سمنان
قزوین
کرمان
گیلان
همدان
اتریش
بحرین
بلژیک
برزیل
کومور
گابون
آلمان
یونان
گویان
ایران
لائوس
لتونی
لبنان
لسوتو
مالزی
موریس
مکزیک
مراکش
آروبا
نیووی
روسیه
ساموآ
سنگال
سودان
سوئیس
سوریه
تونگا
ترکیه
گرنزی
آبخاز
کوزوو
شوشتر
جیرفت
اهواز
ملکان
نوشهر
کاشان
دورود
سمیرم
کلیبر
کهنوج
تبریز
شهرضا
شبستر
ملایر
مراغه
اقلید
بروجن
بهشهر
بیجار
ملاوی
رامسر
بوکان
ممسنی
قوچان
شیراز
کاشمر
سنندج
سردشت
داراب
طرقبه
بندپی
سلماس
محلات
آباده
فردوس
هرسین
مهران
لامرد
الشتر
دلفان
خرامه
کربال
نائین
شازند
لنجان
فریدن
دزفول
رودسر
خلخال
ماسال
رضویه
کنگان
جاجرم
گناوه
تیران
کلاله
دهدشت
بهمئی
مهریز
رودان
میناب
لاشار
هفتگل
دینور
گتوند
گرگان
هفتکل
ملارد
کورین
قلتوق
جفتای
خوشاب
پیشوا
سیریک
بهمنی
خنداب
بیدگل
باخزر
چالوس
پلدشت
ترکمن
دلگان
سرعین
ریگان
هویزه
فاروج
سوران
زابلی
کنارک
فردیس
پردیس
باخرز
جغتای
کارون
هامون
بویین
اتاوا
اربیل
آبوجا
برلین
بغداد
بیروت
بیشکک
پاریس
پرایا
تالین
تایپه
تفلیس
توکیو
تیمفو
داکار
زاگرب
صوفیه
قاهره
کلمبو
لاپاز
ماسرو
مانیل
منامه
مینسک
نیامی
هانوی
وادوز
والتا
رودآب
لوجلی
صیدون
قیدار
بسطام
بمپور
بزمان
ادیمی
بنجار
اسپکه
میمند
سورمق
نودان
وراوی
الوند
ارداق
کوهین
زرینه
شویشه
چناره
بروات
پاریز
جوپار
باغین
شهداد
چترود
مردهک
سومار
سرمست
نودشه
نوسود
ازگله
یاسوج
چیتاب
منجیل
هشتپر
اسالم
لیسار
لوشان
مرجغل
شلمان
آلاشت
کیاسر
رویان
بازنه
اروپا
سنجان
فیجان
پرندک
سندرک
فرسفج
زنگنه
برزول
ندوشن
دیهوک
مروست
نایین
بوئین
عَمان
اِوَز
کَوار
اَهِل
شهرقم
شهربم
شهرجم
شهربن
شهررم
شهرری
آسیا
رابر
بلیز
بنین
شیلی
کوبا
قبرس
فیجی
گینه
عراق
ژاپن
اردن
کنیا
کویت
لیبی
نپال
هلند
نیجر
نروژ
عمان
سیشل
سوئد
توگو
تونس
سارک
جرسی
گوآم
تفرش
مشهد
ساری
بناب
زرند
ازنا
جهرم
پاوه
خواف
زابل
بافت
نقده
ماکو
درگز
بانه
مغان
بابل
ایذه
فومن
سرخس
مرند
قمصر
نطنز
ابهر
سراب
اراک
طارم
میمه
بستک
هریس
جلفا
خمین
تالش
تکاب
ساوه
قروه
آبیک
اسکو
املش
صدوق
کرون
نمین
مانه
کلات
کوار
چرام
بافق
خاتم
اردل
کیار
جاسک
دشتی
گراش
زاوه
جوین
میبد
باوی
آران
دیلم
سرخه
باشت
گرمه
سنقر
راور
فنوج
آشار
فهرج
اسلو
آپیا
آکرا
باکو
پراگ
داکا
دمشق
دوحه
دیلی
روسو
ریاض
ریگا
سئول
سووا
صنعا
کابل
کیتو
لندن
لومه
لیما
مسقط
مسکو
ورشو
دندی
سجاس
نگور
جالق
راسک
بیرم
صغاد
ششده
نرجه
راین
نودژ
هلشی
لیکک
لنده
دلند
چوبر
زاغه
گراب
گزنک
بلده
گتاب
فریم
نراق
توره
لنگه
گیان
سامن
مُهر
یزد
چاد
چین
مصر
غنا
هند
پرو
قطر
یمن
حلب
رزن
فسا
رشت
آوج
سقز
خاش
کرج
شوش
آمل
طبس
اهر
خوی
شفت
نیر
نکا
قشم
خنج
زهک
تفت
خور
دنا
شوط
آتن
برن
پکن
نوک
وین
درق
مجن
لار
اوز
دهج
فین
بِن
قم
ری
رونالدو
بنزما
بانکیمون
داعش
رونالدو
آسیا
اروپا
آمریکا
آفربقا
اقیانوسیه
اوباما
ترامت""".decode("utf-8").splitlines()

AKE_TAG_MASDAR_LIST = \
"""نمیخواستن
میخواستن
نیوفتادن
افتادندن
نخواستن
نمیرفتن
نمیکردن
نمیبودن
میرفتن
نمیشدن
میکردن
نخوردن
ننوشتن
نرفتن
نبودن
نکردن
نیستن
میشدن
خوردن
نوشتن
ندیدن
نشدن
رفتن
بودن
کردن
کشیدن
هستن
دیدن
شدن
بخونن
دارن
ندارن
خوردین
نخوردین
دیدین
ندیدین
بخونین
نخونین
افتادین
نیوفتادین
نافتادین
شدین
نشدین
بودین
نبودین
دارین
ندارین
ندادن
ندادین
نگذرن
نگذرین
نموندن
نموندین
نبندن
نبندین
نبستن
نبستین
میکنن
موندن
دادن
شدن
نشدن
ببندن
بستن
بگذرن
بیاورن
بیارن
بیارین
میکردین
کردین
اومدن
نیامدن
نداشتن
نداشتین
داشتن
داشتین
آمدن
گرفتن
بردن
شمردن
نشمردن
گذاشتن
گذاشتین
گفتن
گفتین
فرمودن
آوردن
بخورن
زدن
نشستن
آوردنن
نگذاشتن
نبردن
نیاوردن
ننشستن
بگیرن
میتوان
میداشتن
میبردن
میشمردن
میگفتن
میزدن
نمیخوردن
نمیکنن
نمیدادن
نمیخواهین
آمدن
نمیداشتن
نمیزدن
نیاین
ماندن
رسیدن
دانستن
شکستن
انداختن
نمیرسن
نمیخورن
میدانین
میخورین
میخورن
میشکنن
میاندازن""".decode("utf-8").splitlines()

AKE_TAG_BLACK_LIST = \
"""همه چیز
جمع خبرنگاران
تحت تاثیر
بالا بلوک
هزار تومانی
تاریخ گذشته
حصار بالا
جگین بالا
عاملان قتل
پنج بالا
شور بالا
آب بالا
بالا کن
سفید بالا
آبرو بالا
ورودی بیمارستان
کوشک بالا
داوری بالا
بالا پایین
فوتبال دنیا
شرایط مناسب
بالا خانلو
بالا بلندی
دهشاد بالا
زیبادشت بالا
درون ساخت
جلسه تمرینی
هفته جاری
دیدار تیم‌های
برنامه زمانی
مرگ و زندگی
شدت بارش‌ها
هم‌استانی‌های عزیز
لگد درون
شب بیرون
کارزار بیرون
میلیون دلاری
شب گذشته
صبح گذشته
زمان اعلام
اجرای برنامه
شماره سه
آشنا شوید
علت اصلی
درگیر شدند
آب کنار
علت افزایش
دو نشان
دوست ندارند
جشن گرفتن
فصل جاری
برنامه کاری
ارائه خدمات
هجری شمسی
هفته گذشته
سالی که گذشت
افزایش یافت
افزایش می‌یابد
تامین هزینه
اجرایی شدن
کار اجرایی
هجری قمری
میلیارد ریال
مورد استقبال
تحت هر شرایطی
زخمی شدند
ماه مه
ایجاد رابطه
مسیر اصلی
مورد نیاز
کشف کردند
بیش از هزار
میلیون تن
جام نیوز
بدون تفهیم
شهادت رسید
دنبال تومی‌گردم
دنبال علم
دنبال کمک
آب دنبال
سلامت نیوز
سه عضو
پایگاه خبری
اقتصاد آنلاین
عضو شورای
جلسه شورای
ورزش سه
پایگاه اطلاع‌رسانی
بدون شک
فضای مناسبی
بدون مشکل
تدابیر لازم
کسی نمی‌داند
تاکید بر لزوم
اتفاق افتاد
دو نفر
سه نفر
دستور کار
اقدامات اطلاعاتی
حکم صادره
مقام دوم
غیرقابل انکار
فاقد اعتبار
دستگاه‌های عضو
بیش از هزار
آسیب رساندن
میلیارد دلار
میلیون دلار
گام مهمی
مصاحبه با شبکه
جام نیوز
سه بار
متهمان ردیف
نداشته باشند
نزدیک شدن
بیش از حد
شرایط کنونی
دریافت می‌کنند
برچسب ها
تنها راه
روابط عمومی
بهره‌وری بالا
قدرت رقابت
افزایش یابد
دست دادن
قدس آنلاین
پرداخت نشده
دیده نشده
داخلی و خارجی
دوست دارم
بن ده
ده ده
پس ده
گته ده
بره ده
زیر ده
دست ده
حل نشده
ف س
ف ف
تب Q
ی بی
مه ر
مس ب
کو ک
ح کت
آب ب
اس آ
اس ا
بن س
بن ده
ده ده
پس ده
یو یو
فی آب
ه ژار
پک فا
ام ال
ام ان
پ ی د
ال اس
اب پز
او اس
س نان
شب پر
جی آر
لب اب
دل دل
مدل T
مک گی
کل ول
جک لو
پل گپ
آی او
فرو ر
کف سر
ان لی
چک چک
شکل س
چپ چپ
نی چی
پل ری
بی دو
حق بن
دی ان
دی ال
علی ع
ور دل
آتش ب
پل نو
کف ها
د ویز
کف زن
ای یو
نت پک
اچ اف
لش سر
نی نی
تک گل
او می
اد لی
حق آب
ام دی
فب لب
بی سی
او دو
کل کش
سه تن
خط دو
ده دی
شب بد
مه دی
تق تق
کد IR
شش زن
ان سر
ان سه
دهه ف
شب زی
S6 اج
شن سا
چم گز
مد جو
دم آب
گو می
ای پد
تیم ب
اس ام
گچ پژ
دل سگ
آاس آ
آاس پ
ده سد
پل اچ
سد دز
سن پل
اه اه
اس آی
آر اف
ده گل
ان اس
شی ان
جت لگ
جت لی
کی کی
د پول
سد اب
د سان
چین B
کاگ ب
صد تن
سد زد
ان کی
جک s5
تی تک
دو زن
س تند
ها سر
هی دی
بت ال
وب ام
فت کش
کد QR
جک S5
حق اب
سی او
شش تن
تپ سی
چم چم
سه زن
کل سر
ای زد
پت کش
اف ای
دو سد
رت پک
اس پن
رک گو
ره ها
کل شی
ظرف س
نی یز
اس ای
تیم آ
په له
گل رس
ی پ گ
آی سی
رام ا
دو تن
شی فی
سی ال
اف بی
بی ام
می می
ری بن
خط زد
حس بد
ای او
ای ار
حق زن
سه مغ
تی ای
شش آب
ها می
سه چی
پ ملل
جت پک
گل رز
حلب ا
C و D
مدل I
چی یو
ام سی
دو ان
سگ دو
ک گ ب
سد آب
لی هو
آی پک
ها دل
تم تم
تی هی
ان جا
مخت ن
تن ذر
سری A
سری E
سری K
پی اس
پی اف
پی اچ
پی گل
یا پی
پیش ش
ان پی
گل پی
سن سن
عم جز
آق سو
آی آی
لی یا
پس پس
یا زن
دانلود فیلم
فیلم اصلی
هفته آینده
گذر زمان
جو پس
یا ته
تک سو
کم اب
د میل
ابراز امیدواری
مورد عجیب
انالله واناالیه راجعون
تحت نظر
تاریکی شب
مورد علاقه
زمان مناسب
مناطق مختلف
گذشته میلادی
سراسری کتاب
ظرفیت‌های موجود
دریافت کارت
سه بر صفر
ماه پیش
ماه گذشته
سی پی
جی بی
یا می
سه سو
پی پر
دم دم
ها جز
گته ده
بره ده
زیر ده
دست ده
پل چهر
نیل ست
ششم دی
حق ابه
l مرمت
اهل ری
فضای مجازی
هفته اول اردیبهشت‌ماه
اتفاقی عجیب
سالگرد تاسیس
رئیس شبکه
شرایط روحی
هفته پایانی
تصاویر سه بعدی
س انبه
علی اس
بن لار
صبح نو
هزار تومان
قابل ملاحظه‌ای
خداوند متعال
روی زمین
خیلی خوب
بهترین راه
بدترین راه
پیدا کردن
نمایش داده
پایان یافت
مهم نیست
چند تن
سید محمد
ای کاش
جای خالی
افزایش یافته
اقدامات لازم
گفتگو با مهر
بخش‌های مختلف
آغاز فصل
راه یافت
محمد حسین
محمد رضا
محمد علی
لیگ دسته
خبرگزاری فارس
صفحه نخست
هر چی
همه چی
راه و رسم
حل مشکل
عکس و فیلم
کشته و زخمی
بهترین زمان
فیلم فردا
عرصه‌های مختلف
سرویس عکس
سرویس فیلم
فیلم و عکس
پشت سر
باشگاه خبرنگاران جوان
web browser
باشگاه خبرنگاران
خبرنگاران جوان
وبگردی باشگاه خبرنگاران جوان
استان‌های باشگاه خبرنگاران
جام‌جم آنلاین
خبرنگار اعزامی
قابل توجه
خرید این بازیکن
فصل آینده
ارسال به تلگرام
قابل توجهی
سلام علیکم
بسم‌الله الرحمن الرحیم""".decode("utf-8").splitlines()
AKE_N_GRAM = 5
AKE_MIN_TAG_OCCURRENCE = 0
AKE_SAVE_COUNTER = 400

# Text Categorization Parameters
TC_CATEGORY_TRAIN_DOCUMENT_SET_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Formal", "Text-Categorization-Document-Set", "Category-Train")
TC_CATEGORY_TEST_DOCUMENT_SET_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Formal", "Text-Categorization-Document-Set", "Category-Test")
TC_SUBCATEGORY_TRAIN_DOCUMENT_SET_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Formal", "Text-Categorization-Document-Set", "Subcategory-Train")
TC_SUBCATEGORY_TEST_DOCUMENT_SET_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Formal", "Text-Categorization-Document-Set", "Subcategory-Test")
TC_DEFAULT_CATEGORY = "چندرسانه‌ای".decode("utf-8")
TC_N_GRAM = 2
TC_POWER_PARAMETER_1 = 3
TC_POWER_PARAMETER_2 = 1
TC_FEATURE_VECTOR_SIZE_PARAMETER = 0.6
TC_TERM_MIN_DOCUMENT_FREQUENCY_PARAMETER = 0.25
TC_HIDDEN_NEURON_COUNT = 200
TC_BATCH_SIZE = 128
TC_CATEGORY_EPOCH_COUNT = 3
TC_CATEGORY_LEARNING_RATE = 0.0005
TC_SUBCATEGORY_EPOCH_COUNT = 20
TC_SUBCATEGORY_LEARNING_RATE = 0.001
TC_TITLE_TAG_WEIGHT = 3
TC_MIN_FEATURE_VECTOR_NORM_0 = 20

# Related News Parameters
RN_DOCUMENT_HISTORY_QUEUE_SIZE = 10000
RN_CATEGORY_TAG_WEIGHT = 1.0
RN_N_GRAM = 2
RN_TERM_COUNT_PARAMETER = 0.1
RN_MIN_SIMILARITY = 0.2
RN_MAX_SIMILARITY = 0.8
RN_SAVE_COUNTER = 500

# Trend Detection Parameters
TD_TIME_STEP_COUNT = 10
TD_TIME_WINDOW_SECOND = 86400
TD_MIN_TAG_OCCURRENCE_PARAMETER = 0.5
TD_TRENDING_TAG_COUNT = 40

# News Story Parameters
NS_CURRENT_TIME_WINDOW_SECOND = 86400
NS_RESULT_COUNT_PARAMETER = 0.3
NS_TAG_COUNT_PARAMETER = 0.5

# Web Crawling Parameters
WC_MIN_HTML_FILE_SIZE = 10000
WC_MIN_JSON_FILE_SIZE = 400

# Text Summarization Parameters
TS_N_GRAM = 2
TS_MIN_SELECTION_SCORE = 0.1

# Word Embedding Parameters
WE_LEARNING_METHOD = 1   # CBOW = 0 and Skip-Gram = 1
WE_VECTOR_SIZE = 200
WE_WINDOW_SIZE = 8
WE_NEGATIVE_SAMPLE_COUNT = 10
WE_ITERATION_COUNT = 20
WE_MIN_TERM_OCCURRENCE = 10
WE_RESULT_COUNT = 20

# Language Modeling Parameters
LM_MIN_TERM_DOCUMENT_FREQUENCY_PARAMETER = 0.45
LM_TIME_STEP_COUNT = 3
LM_LEARNING_RATE = 0.005
LM_BATCH_SIZE = 128
LM_HIDDEN_NEURON_COUNT = 128
LM_EPOCH_COUNT = 300

# Query Autocomplete Parameters
QAC_MAX_SUGGESTION_COUNT = 20

# Persian POS Tagging Parameters
PPOS_TAG_LIST = ["N", "V", "ADJ", "ADV", "P", "PRO", "CON", "IF", "INT", "SPEC",
                 "MORP", "PP", "DET", "OH", "QUA", "PS", "NP", "MQUA"]

# Persian Verb Stemming Parameters
PVS_MIN_VERB_LENGTH = 3
PVS_MIN_VERB_OCCURRENCE_PARAMETER = 0.2
PVS_MIN_VERB_DIFFERENT_TYPE_COUNT = 3
PVS_SPECIAL_SHORT_VERB_DICTIONARY = {"شد".decode("utf-8"): 0, "زد".decode("utf-8"): 0, "کن".decode("utf-8"): 0}
PVS_PREFIX_LIST = [("فرانمی".decode("utf-8"), "-1"),
                   ("فرامی".decode("utf-8"), "1"),
                   ("فران".decode("utf-8"), "-1"),
                   ("فرا".decode("utf-8"), "1"),
                   ("بازنمی".decode("utf-8"), "-1"),
                   ("بازمی".decode("utf-8"), "1"),
                   ("بازن".decode("utf-8"), "-1"),
                   ("باز".decode("utf-8"), "1"),
                   ("درنمی".decode("utf-8"), "-1"),
                   ("درمی".decode("utf-8"), "1"),
                   ("درن".decode("utf-8"), "-1"),
                   ("در".decode("utf-8"), "1"),
                   ("برنمی".decode("utf-8"), "-1"),
                   ("برمی".decode("utf-8"), "1"),
                   ("برن".decode("utf-8"), "-1"),
                   ("بر".decode("utf-8"), "1"),
                   ("نمی".decode("utf-8"), "-1"),
                   ("می".decode("utf-8"), "1"),
                   ("ن".decode("utf-8"), "-1")]
PVS_POSTFIX_LIST = [e.decode("utf-8") for e in ["ایم", "اید", "اند", "ام", "ای", "ست", "یم", "ید", "ند", "م", "ی", "د"]]

# Sentiment Analysis Parameters
SA_BANK_SENTIMENT_DATA_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Informal", "Sentiment", "bank")
SA_DIGIKALA_SENTIMENT_DATA_FOLDER = os.path.join(os.path.dirname(__file__), "Data", "Informal", "Sentiment", "digikala")
SA_MIN_POSITIVE_SCORE = 1.0
SA_MIN_NEGATIVE_SCORE = 1.0

# Run Project Parameters
RP_INPUT_QUEUE = "post_processing_queue"
RP_OUTPUT_QUEUE = "indexer_job_queue"
RP_TIME_BASED_SERVICE_COUNTER = 300
##########################################################
